num_kan = 4

concentration = [[] for i in range(num_kan)]
temperature = [[] for i in range(num_kan)]
Flow = [[] for i in range(num_kan)]
time_plot = [0]

# ---------определяем параметры для диффузии и теплопроводности----------
D0 = [5e-8, 4e-7, 1.5e-7, 3e-7]  # 4e-8 # 8e-6 m^2/s ---------- коэф диффузии
LLL = [3.352e-6] * num_kan  # 3.352e-9 # коэф температуропроводности нержавеющей стали
UUU = [0.4, 0.7, 0.7, 0.78]  # 0.6 # eV ------- энергия связи
kkk = 8.62e-5  # eV/K ------ коэф Больцмана
To = 20 + 273  # 300  # K --------- начальная температура всего образца
To_end = 530 + 273
vel = 0.00  # скорость прогрева

# ---------определяем параметры геометрии оброазца----------
Rad = 7e-3 / 2  # m # mm r = 3e-3
h = 0.6  # высота образца
MaxNode = 200 + 1  # количесвто узлов
DR = Rad / MaxNode
# -----------------параметры погран слоя----------------
Rl = [Rad * 0.95, Rad * 0.9, Rad * 0.9, Rad * 0.9]
width_l = [0.02 * Rad] * num_kan
width_r = [0.02 * Rad] * num_kan

# ---------определяем параметры времени----------
time0 = 2500  # s
Dt = 10  # -------------------------------------------------------------------------------
Time_pik_1 = 0
Flow_pik_1 = 0

# ---------определяем параметры концентрации----------
C0 = [0] * num_kan  # Моль / м^3 # концентрация вне образца
# C1 = 300  # 962.1169  # Моль / м^3 # концентрация внутри образца
C1 = [10, 30, 10, 50]  # Моль / м^3 # концентрация внутри образца
# C2 = 6000  # 962.1169  # Моль / м^3 # концентрация погран слоя
C2 = [10, 30, 10, 50]  # Моль / м^3 # концентрация погран слоя

# ---------параметры ловушек-----------
VL = 4.9e-6  # 4.9e-6  # m^3/mol
VT1 = 6e-5  # 6e-5  # m^3/mol
# VT1 = 6e-10  # 6e-5  # m^3/mol
K1 = 1.6e-5  # 2.0965e-16  # 1.6e-5  # skal
DT1 = 1e-13
# DT1 = 0
# -----------------------------------