num_kan = 2

concentration = [[] for i in range(num_kan)]
temperature = [[] for i in range(num_kan)]
Flow = [[] for i in range(num_kan)]
time_plot = [[0] for i in range(num_kan)]

# ---------определяем параметры для диффузии и теплопроводности----------
D0 = [8e-6, 8e-5]  # 8e-6 m^2/s ---------- коэф диффузии
LLL = [3.352e-6, 2e-6]  # коэф температуропроводности нержавеющей стали
UUU = [0.1, 0.3]  # eV ------- энергия связи
kkk = 8.62e-5  # eV/K ------ коэф Больцмана
To = 20 + 273  # 300  # K --------- начальная температура всего образца
vel = 0.00  # скорость прогрева

# ---------определяем параметры геометрии оброазца----------
Rad = 2.2e-3 / 2  # m # mm r = 3e-3
h = 0.6  # высота образца
MaxNode = 100 + 1  # количесвто узлов
DR = Rad / MaxNode
Rl = Rad * 0.99
width_l = 0.005 * Rad
width_r = 0.005 * Rad

# ---------определяем параметры времени----------
time0 = 30000  # s
Dt = 100  # -------------------------------------------------------------------------------
Time_pik_1 = 0
Flow_pik_1 = 0

# ---------определяем параметры концентрации----------
C0 = [0, 0]  # Моль / м^3 # концентрация вне образца
# C1 = 300  # 962.1169  # Моль / м^3 # концентрация внутри образца
C1 = [160, 10]
# C2 = 6000  # 962.1169  # Моль / м^3 # концентрация погран слоя
C2 = [6000, 60]

# ---------параметры ловушек-----------
VL = 4.9e-6  # 4.9e-6  # m^3/mol
VT1 = 6e-5  # 6e-5  # m^3/mol
# VT1 = 6e-10  # 6e-5  # m^3/mol
K1 = 1.6e-5  # 2.0965e-16  # 1.6e-5  # skal
DT1 = 1e-13
# DT1 = 0
# -----------------------------------